In [4]:
import pandas as pd

dataf = [
['a',1],
['a',1],
['b',2],
['c',3]]

df = pd.DataFrame(dataf, columns=['letter','number'])

df.shape

(4, 2)

In [5]:
test = df.shape
test[1]

2

In [7]:
df.drop_duplicates(keep='first',subset=['letter'])

  letter  number
0      a       1
2      b       2
3      c       3

In [17]:
df['some_na'] = [5,10,pd.NA, pd.NA]
df.dropna(axis = 0, subset = 'some_na')

  letter  number some_na
0      a       1       5
1      a       1      10

In [19]:
df.rename(columns={'letter':'let',
                   'number':'num_',
                   'some_na':'a_na'},inplace=True)

In [20]:
df

  let  num_  a_na
0   a     1     5
1   a     1    10
2   b     2  <NA>
3   c     3  <NA>

In [22]:
df['num_'].astype('int')

0    1
1    1
2    2
3    3
Name: num_, dtype: int32

In [24]:
df['a_na'].fillna(value=0)

0     5
1    10
2     0
3     0
Name: a_na, dtype: int64

In [26]:
df.append(df)

C:\Users\IM_py\AppData\Local\Temp\ipykernel_72688\443893503.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df)

  let  num_  a_na
0   a     1     5
1   a     1    10
2   b     2  <NA>
3   c     3  <NA>
0   a     1     5
1   a     1    10
2   b     2  <NA>
3   c     3  <NA>

In [29]:
df.drop_duplicates(subset=['let','num_']).pivot(index='let',columns='num_',values='a_na')

num_    1     2     3
let
a       5   NaN   NaN
b     NaN  <NA>   NaN
c     NaN   NaN  <NA>

In [46]:
df_piv = df.drop_duplicates(subset=['let','num_']).pivot(index='let',columns='num_',values='a_na')
df_piv.reset_index()

num_ let    1     2     3
0      a    5   NaN   NaN
1      b  NaN  <NA>   NaN
2      c  NaN   NaN  <NA>

In [45]:

df_piv.reset_index().melt(id_vars='let', var_name='num_')

  let num_ value
0   a    1     5
1   b    1   NaN
2   c    1   NaN
3   a    2   NaN
4   b    2  <NA>
5   c    2   NaN
6   a    3   NaN
7   b    3   NaN
8   c    3  <NA>

In [52]:
df.isnull()

     let   num_   a_na
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False   True

In [59]:
df['let'].str.len()

0    1
1    1
2    1
3    1
Name: let, dtype: int64

In [62]:
df.groupby('let').size().reset_index()

  let  0
0   a  2
1   b  1
2   c  1